Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR34_DFP/2.1.60/atdf/ATSAMR34J18B.atdf
        <module name="MCLK" id="U2234" version="1.0.1">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x40000400"/>
            <parameters>
              <param name="CTRLA_MCSEL_GCLK" value="1"/>
              <param name="CTRLA_MCSEL_OSC8M" value="0"/>
              <param name="MCLK_CLK_APB_NUM" value="5"/>
              <param name="SYSTEM_CLOCK" value="4000000" caption="System Clock Frequency at Reset"/>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
            <clock-groups>
              <clock-group name="AHB" grouporder="0">
                <clock name="HPB0" bit="0"/>
                <clock name="HPB1" bit="1"/>
                <clock name="HPB2" bit="2"/>
                <clock name="HPB3" bit="3"/>
                <clock name="HPB4" bit="4"/>
                <clock name="DSU" bit="5"/>
                <clock name="NVMCTRL" bit="8"/>
                <clock name="HSRAM" bit="9"/>
                <clock name="LPRAM" bit="10"/>
                <clock name="DMAC" bit="11"/>
                <clock name="USB" bit="12"/>
                <clock name="PAC" bit="14"/>
                <clock name="NVMCTRL_PICACHU" bit="15"/>
                <clock name="L2HBRIDGES_H" bit="16"/>
                <clock name="H2LBRIDGES_H" bit="17"/>
                <clock name="HSRAM_AHBSETUPKEEPER" bit="18"/>
                <clock name="HSRAM_HMATRIXLP2HMCRAMCHSBRIDGE" bit="19"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="MTB" id="U2002" version="1.0.0">
          <instance name="MTB">
            <register-group name="MTB" name-in-module="MTB" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="INSTANCE_ID" value="35"/>
            </parameters>
          </instance>
        </module>
        <module name="NVMCTRL" id="U2207" version="3.0.2">
          <instance name="NVMCTRL">
            <register-group name="NVMCTRL" name-in-module="NVMCTRL" address-space="base" offset="0x41004000"/>
            <parameters>
              <param name="FACTORY_WORD_IMPLEMENTED_MASK" value="0XC0000007FFFFFFFF"/>
              <param name="GCLK_ID" value="35" caption="Index of Generic Clock for test"/>
              <param name="PMSB" value="3"/>
              <param name="PSZ_BITS" value="6"/>
              <param name="USER_PAGE_OFFSET" value="0x00800000"/>
              <param name="USER_WORD_IMPLEMENTED_MASK" value="0XC01FFFFFFFFFFFFF"/>
              <param name="RWWEE_PAGES" value="128"/>
              <param name="RWW_EEPROM_ADDR" value="0x00400000" caption="Start address of the WWR EEPROM area"/>
              <param name="RWW_EEPROM_SIZE" value="8192" caption="Byte size of the WWR EEPROM area"/>
              <param name="FLASH_SIZE" value="262144"/>
              <param name="PAGE_SIZE" value="64"/>
              <param name="PAGES" value="4096"/>
              <param name="PAGES_PR_REGION" value="256"/>
              <!--  From Datasheet section "Electrical Characteristics","Flash Characteristics" table "Maximum operating Frequency" -->
              <param name="PSM_0_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="PSM_0_FRMLP_FWS_0_MAX_FREQ" value="18000000"/>
              <param name="PSM_0_FRMLP_FWS_1_MAX_FREQ" value="36000000"/>
              <param name="PSM_0_FRMHS_FWS_0_MAX_FREQ" value="25000000"/>
              <param name="PSM_0_FRMHS_FWS_1_MAX_FREQ" value="50000000"/>
              <param name="PSM_1_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="PSM_1_FRMLP_FWS_0_MAX_FREQ" value="8000000"/>
              <param name="PSM_1_FRMLP_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="INSTANCE_ID" value="34"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="U2207" version="3.0.2">
          <instance name="FUSES">
            <register-group name="OTP5_FUSES" name-in-module="OTP5_FUSES" address-space="fuses" offset="0x00806020"/>
            <register-group name="TEMP_LOG_FUSES" name-in-module="TEMP_LOG_FUSES" address-space="fuses" offset="0x00806030"/>
            <register-group name="USER_FUSES" name-in-module="USER_FUSES" address-space="fuses" offset="0x00804000"/>
          </instance>
        </module>
        <module name="OSCCTRL" id="U2119" version="1.1.0">
          <instance name="OSCCTRL">
            <register-group name="OSCCTRL" name-in-module="OSCCTRL" address-space="base" offset="0x40000C00"/>
            <signals>
              <signal group="XIN" function="XIN" pad="PA14"/>
              <signal group="XOUT" function="XOUT" pad="PA15"/>
            </signals>
            <parameters>
              <param name="DFLL48M_COARSE_MSB" value="5"/>
              <param name="DFLL48M_FINE_MSB" value="9"/>
              <param name="GCLK_ID_DFLL48" value="0" caption="Index of Generic Clock for DFLL48"/>
              <param name="GCLK_ID_FDPLL" value="1" caption="Index of Generic Clock for DPLL"/>
              <param name="GCLK_ID_FDPLL32K" value="2" caption="Index of Generic Clock for DPLL 32K"/>
              <param name="DFLL48M_VERSION" value="0x320"/>
              <param name="FDPLL_VERSION" value="0x200"/>
              <param name="OSC16M_VERSION" value="0x100"/>
              <param name="XOSC_VERSION" value="0x120"/>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="OSC32KCTRL" id="U2246" version="1.1.0">
          <instance name="OSC32KCTRL">
            <register-group name="OSC32KCTRL" name-in-module="OSC32KCTRL" address-space="base" offset="0x40001000"/>
            <signals>
              <signal group="XIN32" function="XIN32" pad="PA00"/>
              <signal group="XOUT32" function="XOUT32" pad="PA01"/>
            </signals>
            <parameters>
              <param name="OSC32K_COARSE_CALIB_MSB" value="6"/>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="U2120" version="1.1.0">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x44000000"/>
            <parameters>
              <param name="HPB_NUM" value="5" caption="Number of bridges AHB/APB"/>
              <param name="INTFLAG_NUM" value="6" caption="Number of intflag registers"/>
              <param name="INSTANCE_ID" value="128"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="U2240" version="1.0.2">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x40000000"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="PD_NUM" value="3" caption="Number of switchable Power Domain"/>
              <param name="INSTANCE_ID" value="0"/>
              <param name="HAS_LINKPD_FIELD" value="1" caption="LINKPD field is present"/>
              <param name="HAS_BBIASHS_FIELD" value="1" caption="BBIASHS field is present"/>
              <param name="HAS_BBIASLP_FIELD" value="1" caption="BBIASLP field is present"/>
              <param name="HAS_PDCFG_FIELD" value="1" caption="PDCFG field is present"/>
              <param name="HAS_DPGPD1_BIT" value="1" caption="DPGPD1 bit is present"/>
              <param name="HAS_DPGPD0_BIT" value="1" caption="DPGPD0 bit is present"/>
              <param name="HAS_IORET_BIT" value="1" caption="IORET bit is present"/>
              <param name="HAS_IDLE2_SLEEP_AS_IDLE" value="1" caption="IDLE2 Sleep mode is called IDLE"/>
              <param name="HAS_BACKUP_SLEEP" value="1" caption="BACKUP Sleep mode supported"/>
              <param name="HAS_OFF_SLEEP" value="1" caption="OFF Sleep mode supported"/>
              <param name="HAS_PLCFG" value="1" caption="Performance Level Configuration supported"/>
            </parameters>
          </instance>
        </module>
