Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR34_DFP/2.1.60/atdf/ATSAMR34J18B.atdf
    <module name="PM" id="U2240" version="1.0.2" caption="Power Manager">
      <register-group name="PM" caption="Power Manager">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="IORET" caption="I/O Retention" mask="0x4"/>
        </register>
        <register name="SLEEPCFG" offset="0x1" rw="RW" size="1" initval="0x02" caption="Sleep Configuration">
          <bitfield name="SLEEPMODE" caption="Sleep Mode" mask="0x7" values="PM_SLEEPCFG__SLEEPMODE"/>
        </register>
        <register name="PLCFG" offset="0x2" rw="RW" size="1" initval="0x00" caption="Performance Level Configuration">
          <bitfield name="PLSEL" caption="Performance Level Select" mask="0x3" values="PM_PLCFG__PLSEL"/>
          <bitfield name="PLDIS" caption="Performance Level Disable" mask="0x80"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="PLRDY" caption="Performance Level Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="PLRDY" caption="Performance Level Ready interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="PLRDY" caption="Performance Level Ready" mask="0x1"/>
        </register>
        <register name="STDBYCFG" offset="0x8" rw="RW" size="2" initval="0x0000" caption="Standby Configuration">
          <bitfield name="PDCFG" caption="Power Domain Configuration" mask="0x3" values="PM_STDBYCFG__PDCFG"/>
          <bitfield name="DPGPD0" caption="Dynamic Power Gating for PD0" mask="0x10"/>
          <bitfield name="DPGPD1" caption="Dynamic Power Gating for PD1" mask="0x20"/>
          <bitfield name="VREGSMOD" caption="Voltage Regulator Standby mode" mask="0xC0" values="PM_STDBYCFG__VREGSMOD"/>
          <bitfield name="LINKPD" caption="Linked Power Domain" mask="0x300" values="PM_STDBYCFG__LINKPD"/>
          <bitfield name="BBIASHS" caption="Back Bias for HMCRAMCHS" mask="0xC00"/>
          <bitfield name="BBIASLP" caption="Back Bias for HMCRAMCLP" mask="0x3000"/>
          <bitfield name="BBIASPP" caption="Back Bias for PicoPram" mask="0xC000"/>
        </register>
        <register name="PWSAKDLY" offset="0xC" rw="RW" size="1" initval="0x00" caption="Power Switch Acknowledge Delay">
          <bitfield name="DLYVAL" caption="Delay Value" mask="0x7F"/>
          <bitfield name="IGNACK" caption="Ignore Acknowledge" mask="0x80"/>
        </register>
      </register-group>
      <value-group name="PM_SLEEPCFG__SLEEPMODE">
        <value name="IDLE" caption="CPU, AHBx, and APBx clocks are OFF" value="2"/>
        <value name="STANDBY" caption="All Clocks are OFF" value="4"/>
        <value name="BACKUP" caption="Only Backup domain is powered ON" value="5"/>
        <value name="OFF" caption="All power domains are powered OFF" value="6"/>
      </value-group>
      <value-group name="PM_PLCFG__PLSEL">
        <value name="PL0" caption="Performance Level 0" value="0x0"/>
        <value name="PL1" caption="Performance Level 1" value="0x1"/>
        <value name="PL2" caption="Performance Level 2" value="0x2"/>
      </value-group>
      <value-group name="PM_STDBYCFG__LINKPD">
        <value name="DEFAULT" caption="Power domains are not linked" value="0"/>
        <value name="PD01" caption="PD0 and PD1 power domains are linked" value="1"/>
        <value name="PD12" caption="PD1 and PD2 power domains are linked" value="2"/>
        <value name="PD012" caption="All power domains are linked" value="3"/>
      </value-group>
      <value-group name="PM_STDBYCFG__PDCFG">
        <value name="DEFAULT" caption="All power domains switching is handled by hardware." value="0"/>
        <value name="PD0" caption="PD0 is forced ACTIVE. PD1 and PD2 power domains switching is handled by hardware." value="1"/>
        <value name="PD01" caption="PD0 and PD1 are forced ACTIVE. PD2 power domain switching is handled by hardware." value="2"/>
        <value name="PD012" caption="All power domains are forced ACTIVE." value="3"/>
      </value-group>
      <value-group name="PM_STDBYCFG__VREGSMOD">
        <value name="AUTO" caption="Automatic mode" value="0"/>
        <value name="PERFORMANCE" caption="Performance oriented" value="1"/>
        <value name="LP" caption="Low Power oriented" value="2"/>
      </value-group>
      <value-group name="PM_STDBYCFG__BBIASHS">
        <value name="RETBB" caption="Retention Back Biasing mode" value="0"/>
        <value name="STDBYBB" caption="Standby Back Biasing mode" value="1"/>
        <value name="STDBYOFF" caption="Standby OFF mode" value="2"/>
        <value name="OFF" caption="Always OFF mode" value="3"/>
      </value-group>
      <value-group name="PM_STDBYCFG__BBIASLP">
        <value name="RETBB" caption="Retention Back Biasing mode" value="0"/>
        <value name="STDBYBB" caption="Standby Back Biasing mode" value="1"/>
        <value name="STDBYOFF" caption="Standby OFF mode" value="2"/>
        <value name="OFF" caption="Always OFF mode" value="3"/>
      </value-group>
    </module>
    <module name="PORT" id="U2210" version="2.0.1" caption="Port Module">
      <register-group name="GROUP" size="0x80">
        <register name="DIR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Data Direction">
          <bitfield name="DIR" caption="Port Data Direction" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:DIR" initval="0x00000000" caption="Data Direction Clear">
          <bitfield name="DIRCLR" caption="Port Data Direction Clear" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRSET" offset="0x8" rw="RW" size="4" atomic-op="set:DIR" initval="0x00000000" caption="Data Direction Set">
          <bitfield name="DIRSET" caption="Port Data Direction Set" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRTGL" offset="0xC" rw="RW" size="4" atomic-op="toggle:DIR" initval="0x00000000" caption="Data Direction Toggle">
          <bitfield name="DIRTGL" caption="Port Data Direction Toggle" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUT" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Data Output Value">
          <bitfield name="OUT" caption="Port Data Output Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTCLR" offset="0x14" rw="RW" size="4" atomic-op="clear:OUT" initval="0x00000000" caption="Data Output Value Clear">
          <bitfield name="OUTCLR" caption="Port Data Output Value Clear" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTSET" offset="0x18" rw="RW" size="4" atomic-op="set:OUT" initval="0x00000000" caption="Data Output Value Set">
          <bitfield name="OUTSET" caption="Port Data Output Value Set" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTTGL" offset="0x1C" rw="RW" size="4" atomic-op="toggle:OUT" initval="0x00000000" caption="Data Output Value Toggle">
          <bitfield name="OUTTGL" caption="Port Data Output Value Toggle" mask="0xFFFFFFFF"/>
        </register>
        <register name="IN" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Data Input Value">
          <bitfield name="IN" caption="Port Data Input Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="CTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Control">
          <bitfield name="SAMPLING" caption="Input Sampling Mode" mask="0xFFFFFFFF"/>
        </register>
