Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR34_DFP/2.1.60/atdf/ATSAMR34J18B.atdf
        <register name="SHPR3" offset="0xD20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="System Handler Priority Register 3">
          <bitfield name="PRI_14" caption="Priority of system handler 14, PendSV" mask="0xFF0000"/>
          <bitfield name="PRI_15" caption="Priority of system handler 15, SysTick exception" mask="0xFF000000"/>
        </register>
        <register name="SHCSR" offset="0xD24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="System Handler Control and State Register">
          <bitfield name="SVCALLPENDED" caption="no description available" mask="0x8000"/>
        </register>
        <register name="DFSR" offset="0xD30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Debug Fault Status Register">
          <bitfield name="HALTED" caption="Halt request debug event active" mask="0x1"/>
          <bitfield name="BKPT" caption="Breakpoint debug event" mask="0x2"/>
          <bitfield name="DWTTRAP" caption="DWT debug event" mask="0x4"/>
          <bitfield name="VCATCH" caption="Vector catch debug event" mask="0x8"/>
          <bitfield name="EXTERNAL" caption="EDBGRQ debug event" mask="0x10"/>
        </register>
      </register-group>
      <value-group name="SystemControl_ICSR__NMIPENDSET">
        <value name="VALUE_0" caption="Write: no effect; read: NMI exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes NMI exception state to pending; read: NMI exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSTCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the SysTick exception" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSTSET">
        <value name="VALUE_0" caption="Write: no effect; read: SysTick exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes SysTick exception state to pending; read: SysTick exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSVCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the PendSV exception" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSVSET">
        <value name="VALUE_0" caption="Write: no effect; read: PendSV exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes PendSV exception state to pending; read: PendSV exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_AIRCR__ENDIANNESS">
        <value name="VALUE_0" caption="Little-endian" value="0"/>
        <value name="VALUE_1" caption="Big-endian" value="1"/>
      </value-group>
      <value-group name="SystemControl_AIRCR__SYSRESETREQ">
        <value name="VALUE_0" caption="No system reset request" value="0"/>
        <value name="VALUE_1" caption="Asserts a signal to the outer system that requests a reset" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SEVONPEND">
        <value name="VALUE_0" caption="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" value="0"/>
        <value name="VALUE_1" caption="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__STKALIGN">
        <value name="VALUE_0" caption="4-byte aligned" value="0"/>
        <value name="VALUE_1" caption="8-byte aligned" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="SAMR34" caption="SAMR34">
      <pin position="DIO0" pad="PB16" type="INTERNAL_I1"/>
      <pin position="DIO1" pad="PA11" type="INTERNAL_I2"/>
      <pin position="DIO2" pad="PA12" type="INTERNAL_I3"/>
      <pin position="DIO3" pad="PB17" type="INTERNAL_I4"/>
      <pin position="DIO4" pad="PA10" type="INTERNAL_I5"/>
      <pin position="DIO5" pad="PB00" type="INTERNAL_I6"/>
      <pin position="RF_MISO" pad="PC19" type="INTERNAL_I7"/>
      <pin position="RF_MOSI" pad="PB30" type="INTERNAL_I8"/>
      <pin position="RF_NRST" pad="PB15" type="INTERNAL_J1"/>
      <pin position="RF_NSS" pad="PB31" type="INTERNAL_J2"/>
      <pin position="RF_SCK" pad="PC18" type="INTERNAL_J3"/>
      <pin position="A1" pad="RFI_HF"/>
      <pin position="A2" pad="GND_RF"/>
      <pin position="A3" pad="PA00"/>
      <pin position="A4" pad="PA01"/>
      <pin position="A5" pad="VDDCORE"/>
      <pin position="A6" pad="VSW"/>
      <pin position="A7" pad="VDDIN"/>
      <pin position="A8" pad="VDDIO"/>
      <pin position="B1" pad="RFO_HF"/>
      <pin position="B2" pad="GND_HF"/>
      <pin position="B3" pad="GNDANA"/>
      <pin position="B4" pad="PB02"/>
      <pin position="B5" pad="GNDIO"/>
      <pin position="B6" pad="RESET_N"/>
      <pin position="B7" pad="GNDIO"/>
      <pin position="B8" pad="PA24"/>
      <pin position="C1" pad="VDDIN_RF"/>
      <pin position="C2" pad="VDDANA"/>
      <pin position="C3" pad="PB03"/>
      <pin position="C4" pad="PA05"/>
      <pin position="C5" pad="PA30"/>
      <pin position="C6" pad="PA28"/>
      <pin position="C7" pad="PB23"/>
      <pin position="C8" pad="PA25"/>
      <pin position="D1" pad="VRPA_RF"/>
      <pin position="D2" pad="RXTX_RF"/>
      <pin position="D3" pad="PA04"/>
      <pin position="D4" pad="GNDIO"/>
      <pin position="D5" pad="PA31"/>
      <pin position="D6" pad="GNDIO"/>
      <pin position="D7" pad="PA23"/>
      <pin position="D8" pad="PA22"/>
      <pin position="E1" pad="GND_PA"/>
      <pin position="E2" pad="GNDANA"/>
      <pin position="E3" pad="PA06"/>
      <pin position="E4" pad="PA27"/>
      <pin position="E5" pad="PB22"/>
      <pin position="E6" pad="PA17"/>
      <pin position="E7" pad="PA18"/>
      <pin position="E8" pad="PA19"/>
      <pin position="F1" pad="PA_BOOST"/>
      <pin position="F2" pad="GND_RF"/>
      <pin position="F3" pad="PA07"/>
      <pin position="F4" pad="PA08"/>
      <pin position="F5" pad="PA09"/>
      <pin position="F6" pad="PA13"/>
      <pin position="F7" pad="PA16"/>
      <pin position="F8" pad="PA14"/>
      <pin position="G1" pad="RFO_LF"/>
      <pin position="G2" pad="GND_RF"/>
      <pin position="G3" pad="SCAN_MODE"/>
      <pin position="G4" pad="VDDIO"/>
      <pin position="G5" pad="GND_RF"/>
      <pin position="G6" pad="GND_RF"/>
      <pin position="G7" pad="GND_RF"/>
      <pin position="G8" pad="PA15"/>
      <pin position="H1" pad="RFI_RF"/>
      <pin position="H2" pad="VRANA_RF"/>
      <pin position="H3" pad="VDDANA_RF"/>
      <pin position="H4" pad="VRDIG_RF"/>
      <pin position="H5" pad="GND_RF"/>
      <pin position="H6" pad="RF_XTA"/>
      <pin position="H7" pad="RF_XTB"/>
      <pin position="H8" pad="VDDDIG_RF"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
